"""Задача 1:
Создайте программу для управления списком задач.
Пользователь должен иметь возможность добавлять задачи в список и удалять их по завершении.
Каждая задача представляет собой простую строку с описанием.

Указания:
1. Программа должна начинаться с пустого списка задач.
2. Пользователь может добавить новую задачу в список, используя команду add.
3. Пользователь может удалить задачу из списка по индексу, используя команду remove.
4. Пользователь может просмотреть все задачи с их индексами, используя команду list.
5. Пользователь может завершить работу программы, используя команду exit.
6. Программа должна предусматривать обработку ошибок ввода, таких как запрос удаления несуществующего индекса.

Ожидаемый результат:
Программа циклически запрашивает у пользователя команду (add, remove, list или exit для выхода),
выполняет ее и затем снова запрашивает команду.
Программа должна корректно обрабатывать каждую команду и выдавать соответствующие сообщения о статусе операции."""
print("Hello word!")
